<?php
return 'Здравствуйте!

Меня зовут Екатерина Титовская.

Я рада приветствовать Вас на моем сайте.

Богатый практический опыт и желание помогать людям позволили мне совместно с напарницей Вероникой Кирей разработать авторскую методику закрытия родов и травмирующих ситуаций (потерь, абортов, выкидышей, разводов, аварий, гипертравм, краха бизнеса, участия в боевых действиях).

Немедицинской остеопатией занимаюсь уже более 3 лет.

Имею два высших образования (история и остеокоррекция) и одно средне-специальное (акушерка).

Поначалу работала в Воронежском НИИ Связи, с лаборанта выросла до инженера.

Но тяга к восстановлению здоровья людям оказалось настолько сильной, что с 2010 года отучилась на массажиста, стала посещать лекции военного хирурга Адоньева Н.В. по терапии и нутрициологии,
 обучилась ароматерапии, а также прошла обучение по подготовке беременных к родам у Черниковой Е.М. по авторской методике, и у питерской акушер-гинеколога Малышевой Т.А.

Вела курсы по подготовке к родам. Более 10 лет занималась восстановлением новорожденных после родов по технике массаж-гимнастика-плавание, достигая нужного результата без использования медикаментов. Параллельно восстанавливала мамочек после родов и обучала молодые семьи к жизни в гармонии с ребенком.

Наконец, окончила медицинский колледж по специальности акушерка и обучилась на остеопата-биодинамиста в Воронежской Школе Остеокоррекции Вржесинского В.Н. (ученика Смирнова А.Е.).

Этот пройденный путь и все приобретенные навыки помогают мне в остеопатии и биодинамике!

Инженерная специальность дает навык разбираться с тонкостями нервной системы и биомеханики тела.

История научила анализировать и понимать, как эпоха и страна, в которой жил человек, влияет на психику и жизнь в целом, помогая распутывать родовЫе особенности.

Психология - основа для изучения реакций человека на различные события, и также основа для выявления причин возникновения болезней.

Медицина - база по науке о здоровье человеческого тела.

При этом я мама четырех замечательных деток. Имею огромный воспитательный опыт. И благодарна семье в поддержке становления меня как профессионала своего дела.

Приглашаю Вас в это путешествие к самому себе и своему здоровью. А я аккуратно буду сопровождать Вас рядом.';
